import { FateList } from "./oracle";

export const fate: FateList = [
  "大吉",
  { label: "中吉", weight: 2 },
  { label: "吉", weight: 3 },
  { label: "小吉", weight: 3 },
  { label: "末吉", weight: 3 },
  { label: "凶", weight: 2 },
  "大凶",
];

export const funnyFate: FateList = [
  // 状態
  "😊それなり",
  "🙂そこそこ",
  "😰まるで駄目",
  "🐙まるでタコ",

  // ～みたい
  "📅昨日の私みたい",
  "📅明日の私みたい",

  // 天気
  "☀快晴",
  "🌤晴れのち曇り",
  "🌥曇りのち晴れ",
  "🌀台風襲来",
  "☼台風一過",

  // 四字熟語
  "☀青天白日",
  "☁五里霧中",
  "🧐半信半疑",
  "😎完全無欠",
  "🔥阿鼻叫喚",

  // ～しそう
  "🤏角に小指をぶつけそう",
  "空からタライが落ちてきそう",
  "へそくりを持ち出されそう",
  "🍡棚からぼた餅が出てきそう",
  "曲がり角であの子とぶつかりそう",
  "🚪門限にギリギリ間に合わなそう",
  "失くしたものが見つかりそう",
  "🔋スマホの電池が切れそう",

  // 裁判
  "👨‍⚖勝訴",
  "👨‍⚖敗訴",
  "👨‍⚖逆転勝訴",
  "👨‍⚖不当判決",

  // 顔文字
  "ヾ(≧▽≦*)o",
  "q(≧▽≦q)",
  "(;´༎ຶД༎ຶ`)",
  "o((>ω< ))o",
  "ヮ(ﾟдﾟ)ォ!",

  // 順位
  "🥇一位",
  "🥈二位",
  "🥉三位",
  "😱最下位",

  // 受験
  "🌸合格",
  "🥀不合格",

  // 絵文字
  "💎💎💎💎💎",
  "🧁🍧🍭🍡🍹",
];
